==================
Basic string
==================

"hello"

---

(duper_value
  (string
    (quoted_string
      (quoted_content
        (quoted_plain)))))

==================
Raw string
==================

r"I am
powerful"

---

(duper_value
  (string
    (raw_string
      (raw_start)
      (raw_content)
      (raw_end))))

==================
Two slashes in string
==================

"//"

---

(duper_value
  (string
    (quoted_string
      (quoted_content
        (quoted_plain)))))

==================
Mixed plain and escape
==================

"H\x61llo world!\u00f8\u0111."

---

(duper_value
  (string
    (quoted_string
      (quoted_content
        (quoted_plain)
        (quoted_escape)
        (quoted_plain)
        (quoted_escape)
        (quoted_escape)
        (quoted_plain)))))
